pascal-3.2/tutorials/surfaceTracking/newInterTrackFoam/varCapillarity3DoneFluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    ( 0.0 0.0 0.0 ) // # 0
    ( 1.0 0.0 0.0 ) // # 1
    ( 0.0 0.0 1.0 ) // # 2
    ( 1.0 0.0 1.0 ) // # 3
    ( 0.0 1.0 0.0 ) // # 4
    ( 1.0 1.0 0.0 ) // # 5
    ( 0.0 1.0 1.0 ) // # 6
    ( 1.0 1.0 1.0 ) // # 7
);

blocks
(
    hex ( 0 1 5 4 2 3 7 6 ) ( 20 20 20 ) simpleGrading ( 1.0 1.0 1.0 ) // # 0
);

edges
(
);

boundary
(
    bottomWall
    {
        type wall;
        faces
        (
            ( 0 1 3 2 )
        );
    }

    trackedSurface
    {
        type patch;
        faces
        (
            ( 5 4 6 7 )
        );
    }

    sideWalls
    {
        type wall;
        faces
        (
            ( 0 4 6 2 )
            ( 1 5 7 3 )
            ( 0 1 5 4 )
            ( 2 3 7 6 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //


