pascal-3.2/tutorials/surfaceTracking/newInterTrackFoam/varCapillarity3DoneFluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    ddt(rho,U) backward;
    ddt(U) backward;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    defalut none;
    div(phi,U) Gauss linear;
}

laplacianSchemes
{
    default none;
    laplacian(mu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;

    laplacian((1|interpolate(A(U))),p) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    p;
}

// ************************************************************************* //
